W9D5/music_app/app/models/user.rb

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "a@b.com"], ["password_digest", "$2a$12$9Tdy26G7XD19dTuOn..hR.TxcY4jwVvcuVy7suY.JYqA2hiw4pE7W"], ["session_token", "9beuRNaakhXh7EgjOXvfPQ"]]
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "hyEyO9uTpFnN__7Z05NfQg"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = User.generate_session_token
    self.save